Revit 2024 API
BuiltInFailures.RegenFailures.RegeneratedElements Property
 Elements regenerated in pass [Regen Index]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RegeneratedElements { get; }
Visual Basic
Public Shared ReadOnly Property RegeneratedElements As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RegeneratedElements {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace